Ran Plan for 3 projects:

1. dir: `cloudflare` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `unifi` workspace: `default`
---

### 1. dir: `cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.pulsifer_ca_dnssec will be updated in-place
! resource "cloudflare_zone_dnssec" "pulsifer_ca_dnssec" {
+       algorithm        = (known after apply)
+       digest           = (known after apply)
+       digest_algorithm = (known after apply)
+       digest_type      = (known after apply)
+       ds               = (known after apply)
+       flags            = (known after apply)
        id               = "7b0fdf753795ec69a1318f64be8d2479"
+       key_tag          = (known after apply)
+       key_type         = (known after apply)
+       modified_on      = (known after apply)
+       public_key       = (known after apply)
-       status           = "disabled" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. dir: `gcp/projects/homelab-ng` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/atlantis-data/bin/terraform1.14.1 plan -input=false -refresh -out "/atlantis-data/repos/jonpulsifer/infra/363/default/gcp/projects/homelab-ng/default.tfplan"' in '/atlantis-data/repos/jonpulsifer/infra/363/default/gcp/projects/homelab-ng': exit status 1
module.network.google_compute_network.network: Refreshing state... [id=projects/homelab-ng/global/networks/vpc]
google_compute_address.oldboy: Refreshing state... [id=projects/homelab-ng/regions/us-east1/addresses/oldboy]
google_storage_bucket.free: Refreshing state... [id=homelab-ng-free]
google_org_policy_policy.allow_functions_without_vpc_connector: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.requireVPCConnector]
google_service_account.view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com]
google_service_account.vault: Refreshing state... [id=projects/homelab-ng/serviceAccounts/vault-id@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_workload_identity_providers: Refreshing state... [id=projects/homelab-ng/policies/iam.workloadIdentityPoolProviders]
google_storage_bucket.vault: Refreshing state... [id=homelab-ng-vault]
google_storage_bucket.homelab_ng: Refreshing state... [id=homelab-ng]
data.google_iam_policy.gcs_homelab_ng: Reading...
data.google_iam_policy.gcs_homelab_ng: Read complete after 0s [id=3702782091]
google_service_account.terraform: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_functions_vpc_connector_egress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedVpcConnectorEgressSettings]
google_org_policy_policy.allowed_storage_retention_policy_seconds: Refreshing state... [id=projects/homelab-ng/policies/storage.retentionPolicySeconds]
google_service_account.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_service_account.ddnsd: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_cloud_run_binauthz: Refreshing state... [id=projects/homelab-ng/policies/run.allowedBinaryAuthorizationPolicies]
google_org_policy_policy.allow_service_account_keys: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountKeyCreation]
google_org_policy_policy.allow_service_accounts: Refreshing state... [id=projects/homelab-ng/policies/iam.disableServiceAccountCreation]
google_kms_key_ring.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault]
google_org_policy_policy.allowed_cloud_build_worker_pools: Refreshing state... [id=projects/homelab-ng/policies/cloudbuild.allowedWorkerPools]
google_iam_workload_identity_pool.homelab: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab]
google_org_policy_policy.allowed_locations: Refreshing state... [id=projects/homelab-ng/policies/gcp.resourceLocations]
google_org_policy_policy.allowed_functions_ingress_settings: Refreshing state... [id=projects/homelab-ng/policies/cloudfunctions.allowedIngressSettings]
google_org_policy_policy.allowed_cloud_run_vpc_egress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedVPCEgress]
google_org_policy_policy.allow_all_services: Refreshing state... [id=projects/homelab-ng/policies/serviceuser.services]
google_project_service.service["vision.googleapis.com"]: Refreshing state... [id=homelab-ng/vision.googleapis.com]
google_project_service.service["websecurityscanner.googleapis.com"]: Refreshing state... [id=homelab-ng/websecurityscanner.googleapis.com]
google_project_service.service["iam.googleapis.com"]: Refreshing state... [id=homelab-ng/iam.googleapis.com]
google_project_service.service["storage-component.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-component.googleapis.com]
google_project_service.service["bigquery.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquery.googleapis.com]
google_project_service.service["cloudbuild.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbuild.googleapis.com]
google_project_service.service["iamcredentials.googleapis.com"]: Refreshing state... [id=homelab-ng/iamcredentials.googleapis.com]
google_project_service.service["cloudidentity.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudidentity.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=homelab-ng/run.googleapis.com]
google_project_service.service["orgpolicy.googleapis.com"]: Refreshing state... [id=homelab-ng/orgpolicy.googleapis.com]
google_project_service.service["serviceusage.googleapis.com"]: Refreshing state... [id=homelab-ng/serviceusage.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=homelab-ng/compute.googleapis.com]
google_project_service.service["logging.googleapis.com"]: Refreshing state... [id=homelab-ng/logging.googleapis.com]
google_project_service.service["admin.googleapis.com"]: Refreshing state... [id=homelab-ng/admin.googleapis.com]
google_project_service.service["groupssettings.googleapis.com"]: Refreshing state... [id=homelab-ng/groupssettings.googleapis.com]
google_project_service.service["storage-api.googleapis.com"]: Refreshing state... [id=homelab-ng/storage-api.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=homelab-ng/containerregistry.googleapis.com]
google_project_service.service["containeranalysis.googleapis.com"]: Refreshing state... [id=homelab-ng/containeranalysis.googleapis.com]
google_project_service.service["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudresourcemanager.googleapis.com]
google_project_service.service["domains.googleapis.com"]: Refreshing state... [id=homelab-ng/domains.googleapis.com]
google_project_service.service["oslogin.googleapis.com"]: Refreshing state... [id=homelab-ng/oslogin.googleapis.com]
google_project_service.service["maps-backend.googleapis.com"]: Refreshing state... [id=homelab-ng/maps-backend.googleapis.com]
google_project_service.service["cloudfunctions.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudfunctions.googleapis.com]
google_project_service.service["dns.googleapis.com"]: Refreshing state... [id=homelab-ng/dns.googleapis.com]
google_project_service.service["bigquerystorage.googleapis.com"]: Refreshing state... [id=homelab-ng/bigquerystorage.googleapis.com]
google_org_policy_policy.allow_all_domains: Refreshing state... [id=projects/homelab-ng/policies/iam.allowedPolicyMemberDomains]
google_project_service.service["cloudkms.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudkms.googleapis.com]
google_project_service.service["appengine.googleapis.com"]: Refreshing state... [id=homelab-ng/appengine.googleapis.com]
google_service_account.vm: Refreshing state... [id=projects/homelab-ng/serviceAccounts/oldboy@homelab-ng.iam.gserviceaccount.com]
google_org_policy_policy.allowed_cloud_run_ingress: Refreshing state... [id=projects/homelab-ng/policies/run.allowedIngress]
google_project_service.service["cloudbilling.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudbilling.googleapis.com]
google_project_service.service["pubsub.googleapis.com"]: Refreshing state... [id=homelab-ng/pubsub.googleapis.com]
google_project_service.service["binaryauthorization.googleapis.com"]: Refreshing state... [id=homelab-ng/binaryauthorization.googleapis.com]
google_project_service.service["monitoring.googleapis.com"]: Refreshing state... [id=homelab-ng/monitoring.googleapis.com]
google_project_service.service["container.googleapis.com"]: Refreshing state... [id=homelab-ng/container.googleapis.com]
google_project_service.service["iap.googleapis.com"]: Refreshing state... [id=homelab-ng/iap.googleapis.com]
data.google_storage_bucket_objects.files: Reading...
google_project_iam_member.view_counter_firestore: Refreshing state... [id=homelab-ng/roles/datastore.user/serviceAccount:view-counter@homelab-ng.iam.gserviceaccount.com]
google_service_account.ddns: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddns-function@homelab-ng.iam.gserviceaccount.com]
google_project_service.service["cloudasset.googleapis.com"]: Refreshing state... [id=homelab-ng/cloudasset.googleapis.com]
data.google_iam_policy.gcs_vault: Reading...
google_storage_bucket_iam_policy.homelab_ng: Refreshing state... [id=homelab-ng]
data.google_iam_policy.gcs_vault: Read complete after 0s [id=1208234218]
google_project_iam_member.vault: Refreshing state... [id=homelab-ng/organizations/5046617773/roles/readOnlyVault/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.terraform_token_creator: Reading...
data.google_storage_bucket_objects.files: Read complete after 0s [id=homelab-ng-free]
data.google_iam_policy.terraform_token_creator: Read complete after 0s [id=4001634528]
google_project_iam_member.github_actions_function_admin: Refreshing state... [id=homelab-ng/roles/cloudfunctions.admin/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_member.github_actions_view_counter: Refreshing state... [id=projects/homelab-ng/serviceAccounts/view-counter@homelab-ng.iam.gserviceaccount.com/roles/iam.serviceAccountUser/serviceAccount:github-actions@homelab-ng.iam.gserviceaccount.com]
data.google_iam_policy.ddnsd_token_creator: Reading...
data.google_iam_policy.ddnsd_token_creator: Read complete after 0s [id=712373999]
google_project_iam_member.ddnsd: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceAccount:ddnsd-id@homelab-ng.iam.gserviceaccount.com]
module.network.google_compute_subnetwork.subnet: Refreshing state... [id=projects/homelab-ng/regions/us-east1/subnetworks/computers]
module.network.google_compute_firewall.ssh: Refreshing state... [id=projects/homelab-ng/global/firewalls/terraform-auto-ssh-firewall]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/github]
data.google_iam_policy.free: Reading...
data.google_iam_policy.free: Read complete after 0s [id=3790195915]
data.google_iam_policy.github_actions: Reading...
data.google_iam_policy.github_actions: Read complete after 0s [id=1832452650]
google_iam_workload_identity_pool_provider.vercel: Refreshing state... [id=projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/vercel]
google_kms_crypto_key.vault: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault]
data.onepassword_item.cloudflare_api_token: Reading...
google_storage_bucket_iam_policy.vault: Refreshing state... [id=b/homelab-ng-vault]
google_project_iam_member.ddnsbot: Refreshing state... [id=homelab-ng/roles/dns.admin/serviceaccount:ddns-function@homelab-ng.iam.gserviceaccount.com]
google_service_account_iam_policy.terraform_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com]
google_compute_image.nixos: Refreshing state... [id=projects/homelab-ng/global/images/nixos]
google_service_account_iam_policy.ddnsd_token_creator: Refreshing state... [id=projects/homelab-ng/serviceAccounts/ddnsd-id@homelab-ng.iam.gserviceaccount.com]
data.onepassword_item.cloudflare_api_token: Read complete after 1s [id=vaults/ib23znjeikv74p37f6mbfk7uya/items/3x5gu5niywi6iza3jxxny7ifsy]
google_storage_bucket_iam_policy.free: Refreshing state... [id=b/homelab-ng-free]
google_service_account_iam_policy.github_actions: Refreshing state... [id=projects/homelab-ng/serviceAccounts/github-actions@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key_iam_member.vault_encrypt_decrypt: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
google_kms_crypto_key_iam_member.vault_viewer: Refreshing state... [id=projects/homelab-ng/locations/northamerica-northeast1/keyRings/vault/cryptoKeys/vault/roles/cloudkms.viewer/serviceAccount:vault-id@homelab-ng.iam.gserviceaccount.com]
cloudflare_dns_record.oldboy: Refreshing state... [id=bdbd2fdeee6264229fae1ac8138dff8f]
data.cloudflare_ip_ranges.cloudflare: Reading...
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # google_storage_bucket_iam_policy.free will be updated in-place
  ~ resource "google_storage_bucket_iam_policy" "free" {
        id          = "b/homelab-ng-free"
      ~ policy_data = jsonencode(
          ~ {
              ~ bindings = [
                    # (1 unchanged element hidden)
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/storage.admin"
                    },
                  - {
                      - members = [
                          - "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:development",
                          - "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:production",
                        ]
                      - role    = "roles/storage.objectUser"
                    },
                ]
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Error: Invalid index
│ 
│   on compute.tf line 37, in resource "google_compute_image" "nixos":
│   37:     source = "https://storage.googleapis.com/homelab-ng-free/${data.google_storage_bucket_objects.files.bucket_objects[0].name}"
│     ├────────────────
│     │ data.google_storage_bucket_objects.files.bucket_objects is empty list of object
│ 
│ The given key does not identify an element in this collection value: the
│ collection has no elements.
╵

```
</details>

---
### 3. dir: `unifi` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false' in '/atlantis-data/repos/jonpulsifer/infra/363/default/unifi': exit status 1
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Terraform encountered problems during initialisation, including problems
│ with the configuration, described below.
│ 
│ The Terraform configuration must be valid before initialization so that
│ Terraform can determine which modules and providers need to be installed.
│ 
│ 
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 2, in locals:
│    2:   fml_cidr   = "10.1.0.0/24"
│ 
│ A local value named "fml_cidr" was already defined at home.tf:2,3-29. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 3, in locals:
│    3:   fml_domain = "fml.pulsifer.ca"
│ 
│ A local value named "fml_domain" was already defined at home.tf:3,3-33.
│ Local value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 4, in locals:
│    4:   fml_wlan   = "fml"
│ 
│ A local value named "fml_wlan" was already defined at home.tf:4,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 5, in locals:
│    5:   clients    = yamldecode(file("./clients.yaml"))
│ 
│ A local value named "clients" was already defined at home.tf:5,3-50. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 6, in locals:
│    6:   one_day    = 86400
│ 
│ A local value named "one_day" was already defined at home.tf:6,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 7, in locals:
│    7:   one_week   = local.one_day * 7
│ 
│ A local value named "one_week" was already defined at home.tf:7,3-33. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate resource "unifi_network" configuration
│ 
│   on management.tf line 10:
│   10: resource "unifi_network" "fml" {
│ 
│ A unifi_network resource named "fml" was already declared at
│ home.tf:10,1-31. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "unifi_ap_group" configuration
│ 
│   on management.tf line 32:
│   32: data "unifi_ap_group" "all_aps" {
│ 
│ A unifi_ap_group data resource named "all_aps" was already declared at
│ home.tf:32,1-32. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "vault_generic_secret" configuration
│ 
│   on management.tf line 36:
│   36: data "vault_generic_secret" "wifi" {
│ 
│ A vault_generic_secret data resource named "wifi" was already declared at
│ home.tf:36,1-35. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_wlan" configuration
│ 
│   on management.tf line 40:
│   40: resource "unifi_wlan" "fml" {
│ 
│ A unifi_wlan resource named "fml" was already declared at home.tf:40,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 58:
│   58: resource "unifi_user" "personal_devices" {
│ 
│ A unifi_user resource named "personal_devices" was already declared at
│ home.tf:58,1-41. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 73:
│   73: resource "unifi_user" "computers" {
│ 
│ A unifi_user resource named "computers" was already declared at
│ home.tf:73,1-34. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 88:
│   88: resource "unifi_user" "iot" {
│ 
│ A unifi_user resource named "iot" was already declared at home.tf:88,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 103:
│  103: resource "unifi_user" "cameras" {
│ 
│ A unifi_user resource named "cameras" was already declared at
│ home.tf:103,1-32. Resource names must be unique per type in each module.
╵

```
</details>

---
### Plan Summary

3 projects, 1 with changes, 0 with no changes, 2 failed